.config/emacs/init.org
#+title: Emacs Configuration
#+author: Hooregi
#+PROPERTY: header-args:emacs-lisp :tangle ~/Halofiles/.config/emacs/init.el

* Startup Performance

Make startup faster by reducing the frequency of garbage collection and then use a hook to measure Emacs startup time.

#+begin_src emacs-lisp
(defvar halo--gc-cons-threshold gc-cons-threshold)
(defvar halo--gc-cons-percentage gc-cons-percentage)
(defvar halo--file-name-handler-alist file-name-handler-alist)

;; The default is 800 kilobytes.  Measured in bytes.
(setq-default gc-cons-threshold 402653184
              gc-cons-percentage 0.6
              file-name-handler-alist nil)

(defun halo/restore-defaults-after-init ()
  "Restore default values after initialization."
  (setq-default gc-cons-threshold halo--gc-cons-threshold
                gc-cons-percentage halo--gc-cons-percentage
                file-name-handler-alist halo--file-name-handler-alist))

(add-hook 'after-init-hook #'halo/restore-defaults-after-init)

(setq read-process-output-max (* 1024 1024 4) ; 4mb
      inhibit-compacting-font-caches t
      message-log-max 16384)

; Profile emacs startup
(add-hook 'emacs-startup-hook
          (lambda ()
            (message "*** Emacs loaded in %s with %d garbage collections."
                     (format "%.2f seconds"
                             (float-time
                              (time-subtract after-init-time before-init-time)))
                     gcs-done)))
#+end_src

* Package Management

** Repositories

Set up ELPA, MELPA, and Org package repositories and load ~use-package~ to manage package configuration.

#+begin_src emacs-lisp
;; Initialize package sources
(require 'package)

(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("melpa-stable" . "https://stable.melpa.org/packages/")
                         ("org" . "https://orgmode.org/elpa/")
                         ("elpa" . "https://elpa.gnu.org/packages/")))

(package-initialize)
   (unless package-archive-contents
     (package-refresh-contents))
(require 'use-package)

;; Uncomment this to get a reading on packages that get loaded at startup
;;(setq use-package-verbose t)

;; "ensure" packages by default
(setq use-package-always-ensure t)
#+end_src

** ~straight.el~

Trying out ~straight.el~ for package management. So far so good!

#+begin_src emacs-lisp
;; Bootstrap straight.el
(defvar bootstrap-version)
(let ((bootstrap-file
      (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
        "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
        'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

;; Use straight.el for use-package expressions
(straight-use-package 'use-package)

;; Load the helper package for commands like `straight-x-clean-unused-repos'
(require 'straight-x)
#+end_src

* Saner Defaults

** Clean Directory

I don't want a bunch of transient files showing up as untracked in the git repo so I move them all to another location.

#+begin_src emacs-lisp
;; Change the user-emacs-directory to keep unwanted things out of ~/.config/emacs/
(setq user-emacs-directory (expand-file-name "~/.cache/emacs/")
      url-history-file (expand-file-name "url/history" user-emacs-directory))

;; Use no-littering to automatically set common paths to the new user-emacs-directory
(use-package no-littering)

;; Keep customization settings in a temporary file (thanks Ambrevar!)
(setq custom-file
	    (if (boundp 'server-socket-dir)
	        (expand-file-name "custom.el" server-socket-dir)
	      (expand-file-name (format "emacs-custom-%s.el" (user-uid)) temporary-file-directory)))
(load custom-file t)

;; move extra save files to .cache
(setq backup-directory-alist `(("." . "~/.cache/emacs/saves")))
#+end_src

** Custom Libraries

I've got a folder of custom Emacs Lisp libraries which must be added to the =$PATH=.

#+begin_src emacs-lisp
;; Add my library path to load-path
(push "~/Halofiles/.config/emacs/lisp" load-path)
#+end_src

** Coding System

Avoid constant errors about the coding system by setting the default to =UTF-8=.

#+begin_src emacs-lisp
(setq locale-coding-system 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(set-selection-coding-system 'utf-8)
(prefer-coding-system 'utf-8)
#+end_src

** Yes/No = Y/N

#+begin_src emacs-lisp
(defalias 'yes-or-no-p 'y-or-n-p)
#+end_src

** Server Mode

Start the Emacs server from this instance so that all ~emacsclient~ calls are routed here.

#+begin_src emacs-lisp
(server-start)
#+end_src

** Asynchronous Processes

Lets us use asynchronous processes whereever possible, pretty useful.

#+begin_src emacs-lisp
(use-package async
  :ensure t
  :init (dired-async-mode 1))
#+end_src

* Keybindings

** =ESC= to Cancel

#+begin_src emacs-lisp
(global-set-key (kbd "<escape>") 'keyboard-escape-quit)
#+end_src

** Rebind =C-u=

Since I let `evil-mode` take over `C-u` for buffer scrolling, I need to re-bind the `universal-argument` command to another key sequence. I'm choosing `C-M-u` for this purpose.

#+begin_src emacs-lisp
(global-set-key (kbd "C-M-u") 'universal-argument)
#+end_src

** Vim

Some tips can be found here:

- https://github.com/noctuid/evil-guide
- https://nathantypanski.com/blog/2014-08-03-a-vim-like-emacs-config.html

#+begin_src emacs-lisp
(defun halo/evil-hook ()
  (dolist (mode '(custom-mode
                  eshell-mode
                  git-rebase-mode
                  erc-mode
                  circe-server-mode
                  circe-chat-mode
                  circe-query-mode
                  sauron-mode
                  term-mode))
  (add-to-list 'evil-emacs-state-modes mode)))

(defun halo/dont-arrow-me-bro ()
  (interactive)
  (message "Arrow keys are bad, you know?"))

(use-package undo-tree
  :init
  (global-undo-tree-mode 1))

(use-package evil
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-want-C-u-scroll t)
  (setq evil-want-C-i-jump nil)
  (setq evil-respect-visual-line-mode t)
  (setq evil-undo-system 'undo-tree)
  :config
  (add-hook 'evil-mode-hook 'halo/evil-hook)
  (evil-mode 1)
  (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
  (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

  ;; Use visual line motions even outside of visual-line-mode buffers
  (evil-global-set-key 'motion "j" 'evil-next-visual-line)
  (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

  ;; Disable arrow keys in normal and visual modes
  (define-key evil-normal-state-map (kbd "<left>") 'halo/dont-arrow-me-bro)
  (define-key evil-normal-state-map (kbd "<right>") 'halo/dont-arrow-me-bro)
  (define-key evil-normal-state-map (kbd "<down>") 'halo/dont-arrow-me-bro)
  (define-key evil-normal-state-map (kbd "<up>") 'halo/dont-arrow-me-bro)
  (evil-global-set-key 'motion (kbd "<left>") 'halo/dont-arrow-me-bro)
  (evil-global-set-key 'motion (kbd "<right>") 'halo/dont-arrow-me-bro)
  (evil-global-set-key 'motion (kbd "<down>") 'halo/dont-arrow-me-bro)
  (evil-global-set-key 'motion (kbd "<up>") 'halo/dont-arrow-me-bro)

  (evil-set-initial-state 'messages-buffer-mode 'normal)
  (evil-set-initial-state 'dashboard-mode 'normal))

(use-package evil-collection
  :after evil
  :init
  (setq evil-collection-company-use-tng nil)  ;; Is this a bug in evil-collection?
  :custom
  (evil-collection-outline-bind-tab-p nil)
  :config
  (setq evil-collection-mode-list
        (remove 'lispy evil-collection-mode-list))
  (evil-collection-init))
#+end_src

** Keybinding Panel: ~which-key~

~which-key~ is great for getting an overview of what keybindings are available based on the prefix keys you entered. Learned about this one from =Spacemacs=.

#+begin_src emacs-lisp
(use-package which-key
  :init (which-key-mode)
  :diminish which-key-mode
  :config
  (setq which-key-idle-delay 0.7))
#+end_src

** Leader Bindings: ~general.el~

~general.el~ is a fantastic library for defining prefixed keybindings, especially in conjunction with Evil modes.

#+begin_src emacs-lisp
(use-package general
  :config
  (general-evil-setup t)

  (general-create-definer halo/leader-key-def
    :keymaps '(normal insert visual emacs)
    :prefix "SPC"
    :global-prefix "C-SPC")

  (general-create-definer halo/ctrl-c-keys
    :prefix "C-c"))
#+end_src

** Bind with ~keychord~

#+begin_src emacs-lisp
(use-package use-package-chords
  :disabled
  :config (key-chord-mode 1))
#+end_src

** Stateful Keys: ~hydra~

#+begin_src emacs-lisp
(use-package hydra
  :defer 1)
#+end_src

** Jump with ~avy~

#+begin_src emacs-lisp
(use-package avy
  :commands (avy-goto-char avy-goto-word-0 avy-goto-line))

(halo/leader-key-def
  "j"   '(:ignore t :which-key "jump")
  "jj"  '(avy-goto-char :which-key "jump to char")
  "jw"  '(avy-goto-word-0 :which-key "jump to word")
  "jl"  '(avy-goto-line :which-key "jump to line"))
#+end_src

