.config/emacs/init.org
*** Git ~gutter~

#+begin_src emacs-lisp
(use-package git-gutter
  :straight git-gutter-fringe
  :diminish
  :hook ((text-mode . git-gutter-mode)
         (prog-mode . git-gutter-mode))
  :config
  (setq git-gutter:update-interval 2)
  (require 'git-gutter-fringe)
  (set-face-foreground 'git-gutter-fr:added "LightGreen")
  (fringe-helper-define 'git-gutter-fr:added nil
    "XXXXXXXXXX"
    "XXXXXXXXXX"
    "XXXXXXXXXX"
    ".........."
    ".........."
    "XXXXXXXXXX"
    "XXXXXXXXXX"
    "XXXXXXXXXX"
    ".........."
    ".........."
    "XXXXXXXXXX"
    "XXXXXXXXXX"
    "XXXXXXXXXX")

  (set-face-foreground 'git-gutter-fr:modified "LightGoldenrod")
  (fringe-helper-define 'git-gutter-fr:modified nil
    "XXXXXXXXXX"
    "XXXXXXXXXX"
    "XXXXXXXXXX"
    ".........."
    ".........."
    "XXXXXXXXXX"
    "XXXXXXXXXX"
    "XXXXXXXXXX"
    ".........."
    ".........."
    "XXXXXXXXXX"
    "XXXXXXXXXX"
    "XXXXXXXXXX")

  (set-face-foreground 'git-gutter-fr:deleted "LightCoral")
  (fringe-helper-define 'git-gutter-fr:deleted nil
    "XXXXXXXXXX"
    "XXXXXXXXXX"
    "XXXXXXXXXX"
    ".........."
    ".........."
    "XXXXXXXXXX"
    "XXXXXXXXXX"
    "XXXXXXXXXX"
    ".........."
    ".........."
    "XXXXXXXXXX"
    "XXXXXXXXXX"
    "XXXXXXXXXX")

  ;; These characters are used in terminal mode
  (setq git-gutter:modified-sign "≡")
  (setq git-gutter:added-sign "≡")
  (setq git-gutter:deleted-sign "≡")
  (set-face-foreground 'git-gutter:added "LightGreen")
  (set-face-foreground 'git-gutter:modified "LightGoldenrod")
  (set-face-foreground 'git-gutter:deleted "LightCoral"))
#+end_src

** Project Management: ~projectile~

#+begin_src emacs-lisp
(defun halo/switch-project-action ()
  "Switch to a workspace with the project name and start `magit-status'."
  ;; TODO: Switch to EXWM workspace 1?
  (persp-switch (projectile-project-name))
  (magit-status))

(use-package projectile
  :diminish projectile-mode
  :config (projectile-mode)
  :demand t
  :bind-keymap
  ("C-c p" . projectile-command-map)
  :init
  (when (file-directory-p "~/Documents/Projects/Code")
    (setq projectile-project-search-path '("~/Documents/Projects/Code")))
  (setq projectile-switch-project-action #'halo/switch-project-action))

(use-package counsel-projectile
  :after projectile
  :bind (("C-M-p" . counsel-projectile-find-file))
  :config
  (counsel-projectile-mode))

(halo/leader-key-def
  "pf"  'counsel-projectile-find-file
  "ps"  'counsel-projectile-switch-project
  "pF"  'counsel-projectile-rg
  ;; "pF"  'consult-ripgrep
  "pp"  'counsel-projectile
  "pc"  'projectile-compile-project
  "pd"  'projectile-dired)
#+end_src

** LSP (Language Server Protocol)

#+begin_src emacs-lisp
(use-package lsp-mode
  :straight t
  :commands lsp
  :hook ((ocaml-mode python-mode c++-mode) . lsp)
  :bind (:map lsp-mode-map
         ("TAB" . completion-at-point))
  :custom (lsp-headerline-breadcrumb-enable nil))

(halo/leader-key-def
  "l"  '(:ignore t :which-key "lsp")
  "ld" 'xref-find-definitions
  "lr" 'xref-find-references
  "ln" 'lsp-ui-find-next-reference
  "lp" 'lsp-ui-find-prev-reference
  "ls" 'counsel-imenu
  "le" 'lsp-ui-flycheck-list
  "lS" 'lsp-ui-sideline-mode
  "lX" 'lsp-execute-code-action)

(use-package lsp-ui
  :straight t
  :hook (lsp-mode . lsp-ui-mode)
  :config
  (setq lsp-ui-sideline-enable t)
  (setq lsp-ui-sideline-show-hover nil)
  (setq lsp-ui-doc-position 'bottom)
  (lsp-ui-doc-show))

(use-package lsp-ivy
  :hook (lsp-mode . lsp-ivy-mode))
#+end_src

*** Languages

**** Lisp

Use ~parinfer~ for Lispy languages.

#+begin_src emacs-lisp
(use-package parinfer
  :disabled
  :hook ((clojure-mode . parinfer-mode)
         (emacs-lisp-mode . parinfer-mode)
         (common-lisp-mode . parinfer-mode)
         (scheme-mode . parinfer-mode)
         (lisp-mode . parinfer-mode))
  :config
  (setq parinfer-extensions
      '(defaults       ; should be included.
        pretty-parens  ; different paren styles for different modes.
        evil           ; If you use Evil.
        smart-tab      ; C-b & C-f jump positions and smart shift with tab & S-tab.
        smart-yank)))  ; Yank behavior depend on mode.

(halo/leader-key-def
  "tp" 'parinfer-toggle-mode)
#+end_src

This module is absolutely necessary for working inside of Emacs Lisp files, especially when trying to some parent of an expression (like a ~setq~). Makes tweaking Org agenda views much less annoying.

#+begin_src emacs-lisp
(use-package expand-region
  :bind (("M-[" . er/expand-region)
         ("C-(" . er/mark-outside-pairs)))
#+end_src

Meta lisp.

#+begin_src emacs-lisp
(use-package lispy
  :hook ((emacs-lisp-mode . lispy-mode)
         (scheme-mode . lispy-mode)))

;; (use-package evil-lispy
;;   :hook ((lispy-mode . evil-lispy-mode)))

(use-package lispyville
  :hook ((lispy-mode . lispyville-mode))
  :config
  (lispyville-set-key-theme '(operators c-w additional
                              additional-movement slurp/barf-cp
                              prettify)))
#+end_src

Emacs lisp.

#+begin_src emacs-lisp
(add-hook 'emacs-lisp-mode-hook #'flycheck-mode)

(use-package helpful
  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable)
  :bind
  ([remap describe-function] . helpful-function)
  ([remap describe-symbol] . helpful-symbol)
  ([remap describe-variable] . helpful-variable)
  ([remap describe-command] . helpful-command)
  ([remap describe-key] . helpful-key))

(halo/leader-key-def
  "e"   '(:ignore t :which-key "eval")
  "eb"  '(eval-buffer :which-key "eval buffer"))

(halo/leader-key-def
  :keymaps '(visual)
  "er" '(eval-region :which-key "eval region"))
#+end_src

**** Python

#+begin_src emacs-lisp
;; (use-package python-mode
;;   ;; :ensure t
;;   :straight t
;;   :defer t
;;   :hook (python-mode . lsp-deferred)
;;   :custom
;;   (python-shell-interpreter "python3"))

(setq python-shell-interpreter "python3")
#+end_src

#+begin_src emacs-lisp
(use-package pyenv-mode)
#+end_src

**** PKGBUILD

Install it with ~pacman~ running: ~sudo pacman -S emacs-pkgbuild-mode~

#+begin_src emacs-lisp
;;(use-package pkgbuild-mode
;;   :ensure nil
;;  :defer t
;;   :load-path "/usr/share/emacs/site-lisp/"
;;   :mode "/PKGBUILD$")
#+end_src

**** OCaml

#+begin_src emacs-lisp
;;"emacs-tuareg"
#+end_src

**** C++

#+begin_src emacs-lisp
(use-package c-mode
  :straight nil
  :hook (c-mode . lsp-deferred))

(use-package c++-mode
  :straight nil
  :hook (c++-mode . lsp-deferred))
#+end_src

**** YAML

#+begin_src emacs-lisp
(use-package yaml-mode
  :mode "\\.ya?ml\\'")
#+end_src

**** Docker

#+begin_src emacs-lisp
;; (use-package docker-compose-mode
;;   :mode ("docker-compose.yml\\'" . docker-compose-mode)
;; 	("docker-compose.yaml\\'" . docker-compose-mode)
;; 	("stack.yml\\'" . docker-compose-mode))
#+end_src

#+begin_src emacs-lisp
(use-package dockerfile-mode
  :hook (dockerfile-mode . lsp-deferred))
#+end_src

**** CMake

#+begin_src emacs-lisp
(use-package cmake-mode)
#+end_src

**** Solidity

#+begin_src emacs-lisp
(use-package solidity-mode
  :mode ("\\.sol\\'" . solidity-mode)
  :config
  (setq solidity-comment-style 'slash)
  )
#+end_src

**** Lua

#+begin_src emacs-lisp
(use-package lua-mode
  :mode ("\\.lua$" . lua-mode)
  :hook (lua-mode . lsp-deferred)
  :config
  (add-to-list 'interpreter-mode-alist '("lua" . lua-mode)))
#+end_src

** DAP (Debugger Adapter Protocol)

#+begin_src emacs-lisp
(use-package dap-mode
  :straight t
  :custom
  (lsp-enable-dap-auto-configure nil)
  :config
  (dap-ui-mode 1)
  (dap-tooltip-mode 1)
  (require 'dap-node)
  (dap-node-setup))
#+end_src

* Writing Configuration

Writing with zero distractions thanks to ~darkroom~.

#+begin_src emacs-lisp
(use-package darkroom
  :commands darkroom-mode
  :config
  (setq darkroom-text-scale-increase 0))

(defun halo/enter-focus-mode ()
  (interactive)
  (darkroom-mode 1)
  (display-line-numbers-mode 0))

(defun halo/leave-focus-mode ()
  (interactive)
  (darkroom-mode 0)
  (display-line-numbers-mode 1))

(defun halo/toggle-focus-mode ()
  (interactive)
  (if (symbol-value darkroom-mode)
    (halo/leave-focus-mode)
    (halo/enter-focus-mode)))

(halo/leader-key-def
  "tf" '(dw/toggle-focus-mode :which-key "focus mode"))
#+end_src

Spell checker.

#+begin_src emacs-lisp
(use-package ispell
  :config
  (setq ispell-dictionary "british-ize-w_accents"))
#+end_src

** Org Mode

